
[
  {
    "title": "AI/ML Intern",
    "company": "Alpha Ventures",
    "location": "Bengaluru",
    "period": "May 2022 - Apr 2023",
    "description": [
      "Pioneered a Random Forest Regressor, achieving 86% test accuracy in predictive performance for automated irrigation, working with team of 5 as project lead.",
      "Optimized a smart sprinkler system reducing water consumption by 65% compared to traditional methods, outperforming competing “smart” solutions by 15%."
    ]
  },
  {
    "title": "AI Research Intern",
    "company": "Indian Institute of Science (IISc)",
    "location": "Bengaluru",
    "period": "Feb 2023 - Apr 2023",
    "description": [
      "Engineered CNN models integrated with IoT robotics for real-time body-balancing task guidance, boosting system accuracy and improving the learning rate by 50%.",
      "Optimized TensorFlow Lite deployment on Raspberry Pi with AWS S3 data storage to shrink model size and enable low-latency inference, reducing cloud round-trip by 40%.",
      "Fine-tuned GPT-3 to serve as a virtual educator and applied customized reinforcement learning algorithms, enhancing skill acquisition by 60% through adaptive, real-time feedback."
    ]
  },
  {
    "title": "Machine Learning Intern",
    "company": "DHI Flagship and Innovation Centre",
    "location": "Bengaluru",
    "period": "Aug 2020 - Dec 2021",
    "description": [
      "Developed an AI product to assist visually impaired individuals by improving accessibility to public transportation, currency recognition, and road-crossing safety through real-time object-detection and interaction.",
      "Created YOLOv5 and advanced Computer-Vision models (Mobilenet) deployed on edge device, achieving 95% accuracy in identifying public buses and currency denominations in diverse conditions.",
      "Designed and integrated an audio-based interaction system on the Raspberry-Pi, enhancing user experience by reducing response time by 30% and ensuring real-time communication."
    ]
  }
]
